Repository: hachther/mesomb-for-give
Catalog: languages/*.po
Languages: fr

source: Plugin to integrate Mobile payment on GiveWP using Hachther MeSomb
fr: Plugin pour intégrer le paiement mobile sur GiveWP en utilisant Hachther MeSomb

source: Refund via MeSomb Payment Gateway
fr: Remboursement via la Passerelle de paiement MeSomb

source: MeSomb Payment Type
fr: Type de Paiement MeSomb

source: MeSomb Fee
fr: Frais MeSomb

source: Only one refund allowed per transaction by MeSomb Payment Gateway.
fr: Un seul remboursement autorisé par transaction par la passerelle de paiement MeSomb.

source: Refund successful. Refund Reference Id: %1$s, Payment Id: %2$s, Amount Refunded: %3$s, Payment Method: %4$s, Created At: %5$s
fr: Remboursement réussi. ID de référence de remboursement: %1$s, ID de paiement: %2$s, Montant remboursé: %3$s, Mode de paiement: %4$s, Créé le: %5$s

source: Error
fr: Erreur

source: API Credentials
fr: Informations d’identification de l’API

source: MeSomb Application Key
fr: Clé d’Application MeSomb

source: Copy/Paste values from MeSomb Dashboard under Applications -> Your Application > Integration
fr: Copier/coller les valeurs du tableau de bord MeSomb sous Applications -> Votre application > Intégration

source: MeSomb Access Key
fr: Clé d’Accès MeSomb

source: MeSomb Secret Key
fr: Clé Secrète MeSomb

source: Currency Conversion
fr: Conversion de Devises

source: Rely on MeSomb to automatically convert foreign currencies
fr: Faites confiance à MeSomb pour convertir automatiquement les devises étrangères

source: Yes
fr: Oui

source: Countries
fr: Pays

source: You can receive payments from which countries
fr: De quels pays pouvez-vous recevoir des paiements

source: Cameroon
fr: Cameroun

source: MeSomb payment ID is required.
fr: L’ID de paiement MeSomb est requis.

source: Donation failed. Reason: %s
fr: Le don a échoué. Raison: %s

source: Error during the payment process! Please try again and contact the admin if the issue is continue
fr: Erreur lors du processus de paiement ! Veuillez réessayer et contacter l’administrateur si le problème persiste

source: Mobile Money Number
fr: Numéro Mobile Money

source: Orange Money Number
fr: Numéro Orange Money

source: Airtel Money Number
fr: Numéro Airtel Money

source: Please select a service provider.
fr: Veuillez sélectionner un fournisseur de services.

source: Please enter your phone number.
fr: Veuillez entrer votre numéro de téléphone.

source: Pay with your
fr: Payer avec votre

source: Check your phone
fr: Vérifiez votre téléphone

source: Please check your phone to validate payment from Hachther SARL or MeSomb
fr: Veuillez vérifier votre téléphone pour valider le paiement auprès de Hachther SARL ou MeSomb
